espressif/esp-idf/components/soc/esp32p4/include/soc/hp_clkrst_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_HP_CLKRST_REG_H_
#define _SOC_HP_CLKRST_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define HP_CLKRST_VER_DATE_REG          (DR_REG_HP_CLKRST_BASE + 0x0)
/* HP_CLKRST_VER_DATE : R/W ;bitpos:[31:0] ;default: 32'h20201229 ; */
/*description: .*/
#define HP_CLKRST_VER_DATE    0xFFFFFFFF
#define HP_CLKRST_VER_DATE_M  ((HP_CLKRST_VER_DATE_V)<<(HP_CLKRST_VER_DATE_S))
#define HP_CLKRST_VER_DATE_V  0xFFFFFFFF
#define HP_CLKRST_VER_DATE_S  0

#define HP_CLKRST_HP_CTRL_REG          (DR_REG_HP_CLKRST_BASE + 0x4)
/* HP_CLKRST_HP_CPU_ROOT_CLK_SEL : R/W ;bitpos:[3:2] ;default: 2'h1 ; */
/*description: Hp cpu root clock source select; 2'h0: 20M RC OSC; 2'h1: 40M XTAL; 2'h2: HP CPU
PLL clock; 2'h3: HP system PLL clock.*/
#define HP_CLKRST_HP_CPU_ROOT_CLK_SEL    0x00000003
#define HP_CLKRST_HP_CPU_ROOT_CLK_SEL_M  ((HP_CLKRST_HP_CPU_ROOT_CLK_SEL_V)<<(HP_CLKRST_HP_CPU_ROOT_CLK_SEL_S))
#define HP_CLKRST_HP_CPU_ROOT_CLK_SEL_V  0x3
#define HP_CLKRST_HP_CPU_ROOT_CLK_SEL_S  2
/* HP_CLKRST_HP_SYS_ROOT_CLK_SEL : R/W ;bitpos:[1:0] ;default: 2'h1 ; */
/*description: Hp system root clock source select; 2'h0: 20M RC OSC; 2'h1: 40M XTAL; 2'h2: HP s
ystem PLL clock; 2'h3: HP CPU PLL clock.*/
#define HP_CLKRST_HP_SYS_ROOT_CLK_SEL    0x00000003
#define HP_CLKRST_HP_SYS_ROOT_CLK_SEL_M  ((HP_CLKRST_HP_SYS_ROOT_CLK_SEL_V)<<(HP_CLKRST_HP_SYS_ROOT_CLK_SEL_S))
#define HP_CLKRST_HP_SYS_ROOT_CLK_SEL_V  0x3
#define HP_CLKRST_HP_SYS_ROOT_CLK_SEL_S  0

#define HP_CLKRST_CPU_CTRL_REG          (DR_REG_HP_CLKRST_BASE + 0x8)
/* HP_CLKRST_CPU_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define HP_CLKRST_CPU_CLK_CUR_DIV_NUM    0x000000FF
#define HP_CLKRST_CPU_CLK_CUR_DIV_NUM_M  ((HP_CLKRST_CPU_CLK_CUR_DIV_NUM_V)<<(HP_CLKRST_CPU_CLK_CUR_DIV_NUM_S))
#define HP_CLKRST_CPU_CLK_CUR_DIV_NUM_V  0xFF
#define HP_CLKRST_CPU_CLK_CUR_DIV_NUM_S  24
/* HP_CLKRST_CPU_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define HP_CLKRST_CPU_CLK_DIV_NUM    0x000000FF
#define HP_CLKRST_CPU_CLK_DIV_NUM_M  ((HP_CLKRST_CPU_CLK_DIV_NUM_V)<<(HP_CLKRST_CPU_CLK_DIV_NUM_S))
#define HP_CLKRST_CPU_CLK_DIV_NUM_V  0xFF
#define HP_CLKRST_CPU_CLK_DIV_NUM_S  8
/* HP_CLKRST_CPU_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define HP_CLKRST_CPU_CLK_EN    (BIT(0))
#define HP_CLKRST_CPU_CLK_EN_M  (BIT(0))
#define HP_CLKRST_CPU_CLK_EN_V  0x1
#define HP_CLKRST_CPU_CLK_EN_S  0

#define HP_CLKRST_SYS_CTRL_REG          (DR_REG_HP_CLKRST_BASE + 0xC)
/* HP_CLKRST_SYS_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define HP_CLKRST_SYS_CLK_CUR_DIV_NUM    0x000000FF
#define HP_CLKRST_SYS_CLK_CUR_DIV_NUM_M  ((HP_CLKRST_SYS_CLK_CUR_DIV_NUM_V)<<(HP_CLKRST_SYS_CLK_CUR_DIV_NUM_S))
#define HP_CLKRST_SYS_CLK_CUR_DIV_NUM_V  0xFF
#define HP_CLKRST_SYS_CLK_CUR_DIV_NUM_S  24
/* HP_CLKRST_SYS_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: phase offset compare to clock sync signal.*/
#define HP_CLKRST_SYS_CLK_PHASE_OFFSET    0x000000FF
#define HP_CLKRST_SYS_CLK_PHASE_OFFSET_M  ((HP_CLKRST_SYS_CLK_PHASE_OFFSET_V)<<(HP_CLKRST_SYS_CLK_PHASE_OFFSET_S))
#define HP_CLKRST_SYS_CLK_PHASE_OFFSET_V  0xFF
#define HP_CLKRST_SYS_CLK_PHASE_OFFSET_S  16
/* HP_CLKRST_SYS_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define HP_CLKRST_SYS_CLK_DIV_NUM    0x000000FF
#define HP_CLKRST_SYS_CLK_DIV_NUM_M  ((HP_CLKRST_SYS_CLK_DIV_NUM_V)<<(HP_CLKRST_SYS_CLK_DIV_NUM_S))
#define HP_CLKRST_SYS_CLK_DIV_NUM_V  0xFF
#define HP_CLKRST_SYS_CLK_DIV_NUM_S  8
/* HP_CLKRST_SYS_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define HP_CLKRST_SYS_CLK_FORCE_SYNC_EN    (BIT(2))
#define HP_CLKRST_SYS_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define HP_CLKRST_SYS_CLK_FORCE_SYNC_EN_V  0x1
#define HP_CLKRST_SYS_CLK_FORCE_SYNC_EN_S  2
/* HP_CLKRST_SYS_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define HP_CLKRST_SYS_CLK_SYNC_EN    (BIT(1))
#define HP_CLKRST_SYS_CLK_SYNC_EN_M  (BIT(1))
#define HP_CLKRST_SYS_CLK_SYNC_EN_V  0x1
#define HP_CLKRST_SYS_CLK_SYNC_EN_S  1
/* HP_CLKRST_SYS_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define HP_CLKRST_SYS_CLK_EN    (BIT(0))
#define HP_CLKRST_SYS_CLK_EN_M  (BIT(0))
#define HP_CLKRST_SYS_CLK_EN_V  0x1
#define HP_CLKRST_SYS_CLK_EN_S  0

#define HP_CLKRST_PERI1_CTRL_REG          (DR_REG_HP_CLKRST_BASE + 0x10)
/* HP_CLKRST_PERI1_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define HP_CLKRST_PERI1_CLK_CUR_DIV_NUM    0x000000FF
#define HP_CLKRST_PERI1_CLK_CUR_DIV_NUM_M  ((HP_CLKRST_PERI1_CLK_CUR_DIV_NUM_V)<<(HP_CLKRST_PERI1_CLK_CUR_DIV_NUM_S))
#define HP_CLKRST_PERI1_CLK_CUR_DIV_NUM_V  0xFF
#define HP_CLKRST_PERI1_CLK_CUR_DIV_NUM_S  24
/* HP_CLKRST_PERI1_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: phase offset compare to clock sync signal.*/
#define HP_CLKRST_PERI1_CLK_PHASE_OFFSET    0x000000FF
#define HP_CLKRST_PERI1_CLK_PHASE_OFFSET_M  ((HP_CLKRST_PERI1_CLK_PHASE_OFFSET_V)<<(HP_CLKRST_PERI1_CLK_PHASE_OFFSET_S))
#define HP_CLKRST_PERI1_CLK_PHASE_OFFSET_V  0xFF
#define HP_CLKRST_PERI1_CLK_PHASE_OFFSET_S  16
/* HP_CLKRST_PERI1_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define HP_CLKRST_PERI1_CLK_DIV_NUM    0x000000FF
#define HP_CLKRST_PERI1_CLK_DIV_NUM_M  ((HP_CLKRST_PERI1_CLK_DIV_NUM_V)<<(HP_CLKRST_PERI1_CLK_DIV_NUM_S))
#define HP_CLKRST_PERI1_CLK_DIV_NUM_V  0xFF
#define HP_CLKRST_PERI1_CLK_DIV_NUM_S  8
/* HP_CLKRST_PERI1_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define HP_CLKRST_PERI1_CLK_FORCE_SYNC_EN    (BIT(2))
#define HP_CLKRST_PERI1_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define HP_CLKRST_PERI1_CLK_FORCE_SYNC_EN_V  0x1
#define HP_CLKRST_PERI1_CLK_FORCE_SYNC_EN_S  2
/* HP_CLKRST_PERI1_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define HP_CLKRST_PERI1_CLK_SYNC_EN    (BIT(1))
#define HP_CLKRST_PERI1_CLK_SYNC_EN_M  (BIT(1))
#define HP_CLKRST_PERI1_CLK_SYNC_EN_V  0x1
#define HP_CLKRST_PERI1_CLK_SYNC_EN_S  1
/* HP_CLKRST_PERI1_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define HP_CLKRST_PERI1_CLK_EN    (BIT(0))
#define HP_CLKRST_PERI1_CLK_EN_M  (BIT(0))
#define HP_CLKRST_PERI1_CLK_EN_V  0x1
#define HP_CLKRST_PERI1_CLK_EN_S  0

#define HP_CLKRST_PERI2_CTRL_REG          (DR_REG_HP_CLKRST_BASE + 0x14)
/* HP_CLKRST_PERI2_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define HP_CLKRST_PERI2_CLK_CUR_DIV_NUM    0x000000FF
#define HP_CLKRST_PERI2_CLK_CUR_DIV_NUM_M  ((HP_CLKRST_PERI2_CLK_CUR_DIV_NUM_V)<<(HP_CLKRST_PERI2_CLK_CUR_DIV_NUM_S))
#define HP_CLKRST_PERI2_CLK_CUR_DIV_NUM_V  0xFF
#define HP_CLKRST_PERI2_CLK_CUR_DIV_NUM_S  24
/* HP_CLKRST_PERI2_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: phase offset compare to clock sync signal.*/
#define HP_CLKRST_PERI2_CLK_PHASE_OFFSET    0x000000FF
#define HP_CLKRST_PERI2_CLK_PHASE_OFFSET_M  ((HP_CLKRST_PERI2_CLK_PHASE_OFFSET_V)<<(HP_CLKRST_PERI2_CLK_PHASE_OFFSET_S))
#define HP_CLKRST_PERI2_CLK_PHASE_OFFSET_V  0xFF
#define HP_CLKRST_PERI2_CLK_PHASE_OFFSET_S  16
/* HP_CLKRST_PERI2_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define HP_CLKRST_PERI2_CLK_DIV_NUM    0x000000FF
#define HP_CLKRST_PERI2_CLK_DIV_NUM_M  ((HP_CLKRST_PERI2_CLK_DIV_NUM_V)<<(HP_CLKRST_PERI2_CLK_DIV_NUM_S))
#define HP_CLKRST_PERI2_CLK_DIV_NUM_V  0xFF
#define HP_CLKRST_PERI2_CLK_DIV_NUM_S  8
/* HP_CLKRST_PERI2_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define HP_CLKRST_PERI2_CLK_FORCE_SYNC_EN    (BIT(2))
#define HP_CLKRST_PERI2_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define HP_CLKRST_PERI2_CLK_FORCE_SYNC_EN_V  0x1
#define HP_CLKRST_PERI2_CLK_FORCE_SYNC_EN_S  2
/* HP_CLKRST_PERI2_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define HP_CLKRST_PERI2_CLK_SYNC_EN    (BIT(1))
#define HP_CLKRST_PERI2_CLK_SYNC_EN_M  (BIT(1))
#define HP_CLKRST_PERI2_CLK_SYNC_EN_V  0x1
#define HP_CLKRST_PERI2_CLK_SYNC_EN_S  1
/* HP_CLKRST_PERI2_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define HP_CLKRST_PERI2_CLK_EN    (BIT(0))
#define HP_CLKRST_PERI2_CLK_EN_M  (BIT(0))
#define HP_CLKRST_PERI2_CLK_EN_V  0x1
#define HP_CLKRST_PERI2_CLK_EN_S  0

#define HP_CLKRST_PSRAM_PHY_CTRL_REG          (DR_REG_HP_CLKRST_BASE + 0x18)
/* HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM    0x000000FF
#define HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM_M  ((HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM_V)<<(HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM_S))
#define HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM_V  0xFF
#define HP_CLKRST_PSRAM_PHY_CLK_CUR_DIV_NUM_S  24
/* HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: .*/
#define HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM    0x000000FF
#define HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM_M  ((HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM_V)<<(HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM_S))
#define HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM_V  0xFF
#define HP_CLKRST_PSRAM_PHY_CLK_DIV_NUM_S  8
/* HP_CLKRST_PSRAM_PHY_CLK_SEL : R/W ;bitpos:[2:1] ;default: 2'h1 ; */
/*description: .*/
#define HP_CLKRST_PSRAM_PHY_CLK_SEL    0x00000003
#define HP_CLKRST_PSRAM_PHY_CLK_SEL_M  ((HP_CLKRST_PSRAM_PHY_CLK_SEL_V)<<(HP_CLKRST_PSRAM_PHY_CLK_SEL_S))
#define HP_CLKRST_PSRAM_PHY_CLK_SEL_V  0x3
#define HP_CLKRST_PSRAM_PHY_CLK_SEL_S  1
/* HP_CLKRST_PSRAM_PHY_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define HP_CLKRST_PSRAM_PHY_CLK_EN    (BIT(0))
#define HP_CLKRST_PSRAM_PHY_CLK_EN_M  (BIT(0))
#define HP_CLKRST_PSRAM_PHY_CLK_EN_V  0x1
#define HP_CLKRST_PSRAM_PHY_CLK_EN_S  0

